[
  {
    "id": 1,
    "title": "It always rained when Aarav noticed her",
    "text": "It always rained when Aarav noticed her. \n\nThe bus stop was crowded, the sky heavy, and people impatient—but she stood still, holding a pale blue umbrella that didn’t quite match the storm. Her name, he would later learn, was Meera. \n\nEvery evening at 6:40 PM, they shared the same silence.",
    "image": "https://res.cloudinary.com/dhbd74kyg/image/upload/v1765846266/memcard-flashcards/uukbadkmhqlwtk8iqj5x.jpg",
    "alt": "Professional underwater photography, wide-angle lens, capturing a crowded, muted bus stop scene subt"
  },
  {
    "id": 2,
    "title": "Aarav never spoke",
    "text": "Aarav never spoke. Meera never looked first. Yet something invisible passed between them—like a paused moment that neither wanted to break.\n\nOne day, the rain didn’t come.",
    "image": "https://res.cloudinary.com/dhbd74kyg/image/upload/v1765846268/memcard-flashcards/m48f1dulzlbw21p5qs2f.jpg",
    "alt": "Professional underwater photography, medium shot, focusing on the subtle tension and unspoken connec"
  },
  {
    "id": 3,
    "title": "The sky was clear, and Meera wasn’t at the stop",
    "text": "The sky was clear, and Meera wasn’t at the stop. \n\nAarav felt something strange—an absence louder than noise. Days passed. No rain.",
    "image": "https://res.cloudinary.com/dhbd74kyg/image/upload/v1765846270/memcard-flashcards/bnfyh96oh8l2aopl6nu7.jpg",
    "alt": "Professional underwater photography, establishing shot of an empty, serene bus stop rendered with an"
  },
  {
    "id": 4,
    "title": "No blue umbrella",
    "text": "No blue umbrella. No her. \n\nThen, one evening, as the first drops touched the road, he saw her again—this time without the umbrella, hair soaked, smiling as if she had been waiting for the rain just like he had been waiting for her.\n\n“Looks like we both depend on the weather,” she said.",
    "image": "https://res.cloudinary.com/dhbd74kyg/image/upload/v1765846272/memcard-flashcards/duijxegwz1pgpibejfon.jpg",
    "alt": "Professional underwater photography, eye-level shot, capturing a pivotal moment of reunion at a bus "
  },
  {
    "id": 5,
    "title": "Page 5",
    "text": "",
    "image": "https://res.cloudinary.com/dhbd74kyg/image/upload/v1765846275/memcard-flashcards/tudtelzfq69nqmu6rfti.jpg",
    "alt": "Professional underwater photography, a close-up portrait of a young woman, Meera, with a serene expr"
  }
]